""" Homework for the Lesson_08 """
""" Task 03 """

# Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
# Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно,
# пока пользователь сам не остановит работу скрипта, введя, например, команду “stop”.
# При этом скрипт завершается, сформированный список выводится на экран.
# Подсказка: для данного задания примем, что пользователь может вводить только числа и строки.
# При вводе пользователем очередного элемента необходимо реализовать проверку типа элемента и вносить его в список,
# только если введено число. Класс-исключение должен не позволить пользователю ввести текст (не число)
# и отобразить соответствующее сообщение. При этом работа скрипта не должна завершаться.


class MyError(Exception):
    def __init__(self, txt):
        self.txt = txt


num_list = []
while True:
    try:
        num = input('Введите натуральное число (для выхода введите stop): ')
        if num == 'stop':
            break
        if num.isnumeric():
            num_list.append(int(num))
            print(num_list)
        else:
            raise MyError('Недопустимое значение!')
    except MyError as user_mistake:
        print(f'Ошибка: {user_mistake}')
print(f'Окончательный список:\n{num_list}')
