"""Homework for the Lesson_02"""

""" Task 6 """
# 6. * Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами (характеристиками товара:
# название, цена, количество, единица измерения). Структуру нужно сформировать программно,
# т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
# (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
# (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
# (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
# например название, а значение — список значений-характеристик, например список названий товаров.
# Пример:
# {
# “название”: [“компьютер”, “принтер”, “сканер”],
# “цена”: [20000, 6000, 2000],
# “количество”: [5, 2, 7],
# “ед”: [“шт.”]
# }

title, price, amount, unit = None, None, None, None
order = 1
products = []

while True:
    if title is None:
        tmp = input('Введите название товара: ')
        title = tmp

    if price is None:
        tmp = input('Введите стоимость товара: ')
        price = int(tmp)

    if amount is None:
        tmp = input('Введите количество: ')
        amount = int(tmp)

    if unit is None:
        tmp = input('Введите единицы измерения: ')
        unit = tmp

    products.append((order, {'название': title, 'цена': price, 'количество': amount, 'ед.': unit}))
    print(products)

    title, price, amount, unit = None, None, None, None
    order += 1

    question = input('Формирование списка завершить/продолжить? (y / any key)) ')
    if question == 'y' or question == 'Y':
        break

analytics = {'название': [], 'цена': [], 'количество': [], 'ед.': set()}

for i, item in products:
    analytics['название'].append(item['название'])
    analytics['цена'].append(item['цена'])
    analytics['количество'].append(item['количество'])
    analytics['ед.'].add(item['ед.'])
analytics['ед.'] = list(analytics['ед.'])
print(analytics)
