"""Homework for the Lesson_02"""

""" Task 5 """
# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].

rating_list = [8, 6, 3, 3, 2]
print(f'Начальный список "Рейтинг": {rating_list}\n')
while True:
    user_num = int(input("Введите натуральное число (для выхода введите 0): "))
    if user_num == 0:
        break
    idx = None
    for i, num in enumerate(rating_list):
        if user_num > num:
            idx = i
            break
    if idx is None:
        rating_list.append(user_num)
    else:
        rating_list.insert(idx, user_num)
    print(f'Новый измененный список "Рейтинг" {rating_list}\n')
print('Программа завершена пользователем.')
