from itertools import count, cycle

"""Homework for the Lesson_04"""
""" Task 06 """

# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

num = int(input('Введите стартовое число: '))
for el in count(num):
    if el > num + 10:
        print('Конец цикла\n')
        break
    else:
        print(el)

c = 0
my_list = [True, 'ABC', 123, None]
print(f'Исходный список: {my_list}')
for el in cycle(my_list):
    if c > 10:
        print('Конец цикла\n')
        break
    else:
        print(el)
        c += 1
