""" Homework for the Lesson_05 """
""" Task 02 """

# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
# толщиной в 1 см * число см толщины полотна. Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т.


class Road:
    def __init__(self, length, width):  # конструктор класса
        self._length = length
        self._width = width

    def total_mass(self, consumption, depth):  # метод для расчета требуемой массы асфальта
        return self._length * self._width * consumption * depth / 1000


track = Road(5000, 20)  # объект класса Road (передаем заданные параметры)
print(f'Необходимая масса асфальта составляет: {track.total_mass(25, 5)} т.')
