""" Task 05 """
# 5. Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек,
# или убыток — издержки больше выручки). Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.
profit, cost = int(input('Введите значение выручки фирмы: ')), int(input('Укажите значение издержек фирмы: '))
if profit > cost:
    print('Ваша фирма приносит доход')
    rentability = (profit - cost) * 100 / profit
    print(f'Рентабельность вашего бизнеса составляет {round(rentability,2)} %')
    people = int(input('Укажите численность сотрудников фирмы: '))
    profit_man = profit / people
    print(f'Каждый сотрудник принес доход {round(profit_man,2)} денежных единиц ')
elif profit < cost:
    print('Ваша фирма убыточна')
elif profit == cost:
    print('Ваш бизнес находится в точке безубыточности')
