""" Task 04 """
# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
digit = int(input('Введите целое положительное число: '))
max_num = 0
while digit > 0:
    d = digit % 10
    digit //= 10
    if d > max_num:
        max_num = d
print('Самая большая цифра:', max_num)
