""" Homework for the Lesson_05 """
""" Task 06 """

# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб)
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

sum_hours = {}
with open('Task_06_text.txt', 'r', encoding='utf-8') as my_file:
    file_lines = my_file.readlines()  # получаем список всех строк
    for line in file_lines:
        data_line = line.split()  # получаем список каждой строки разбитой по пробелам
        hours = 0
        for i in data_line[1:]:  # для получения часов проходим по статистике каждого предмета (исключая сам предмет)
            if i != '-':  # проходим мимо пустых часов "-"
                num = '0'  # чтобы набрать число в цикле, вначале объявляем его в виде строки
                for elem in i:
                    if elem.isdigit():
                        num += elem  # если символ является числом то формируем его в виде строки
                        print(num)
                    else:
                        break  # если символ не является числом то пропускаем его
                hours += int(num)  # складываем все часы по отдельному предмету
        sum_hours.update({data_line[0].strip(':'): hours})  # strip(':') - для красоты убираем лишние ":"
print(sum_hours)

