from itertools import count, cycle

"""Homework for the Lesson_04"""
""" Task 06 """

# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

num = int(input('Введите стартовое число: '))
list_num = []
for el in count(num):
    if el > num + 10:
        break
    else:
        list_num.append(el)
print(list_num)

c = 0
list_str = []
my_list = ['one', 2, 'three', 4]
print(f'Исходный список:\n{my_list}')
for el in cycle(my_list):
    if c > 10:
        break
    else:
        list_str.append(el)
        c += 1
print(f'Измененный список:\n{list_str}')
