"""Homework for the Lesson_04"""

""" Task 07 """
# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел,
# начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

def num_fact(num):
    num_out = 1
    for i in range(1, num + 1):
        num_out *= i
        yield num_out


try:
    num = int(input('Укажите целое число по которое нужно вычислить значения факториала: '))
    k = 1
    for el in num_fact(num):
        print(f'{k}) {el}')
        k += 1
except ValueError:
    print('Необходимо ввести целое число')
