"""Homework for the Lesson_03"""

""" Task 01 """
# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.


def user_div(num_1, num_2):
    if num_2:
        return round((num_1 / num_2), 3)
    else:
        print('На ноль делить нельзя!')


n_1 = float(input("Введите значение числителя: "))
n_2 = float(input("Введите значение знаменателя: "))
print(f'результат деления: {user_div(n_1, n_2)}')
