"""Homework for the Lesson_03"""

""" Task 04 """
# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


def my_func(x, y):  # Возведение в степень с помощью оператора **
    result = x ** y
    return result


def my_func_cycle(x, y):  # Возведение в отрицательную степень с использованием цикла
    i = -1
    result = 1
    while i >= y:
        result /= x
        i -= 1
    return result


num_1 = float(input('Введите положительное число (база): '))
num_2 = int(input('Введите целое отрицательное число (степень): '))
print(f'{my_func(num_1, num_2)} - Возведение в степень с помощью оператора **')
print(f'{my_func_cycle(num_1, num_2)} - Возведение в степень с использованием цикла')
