"""Homework for the Lesson_03"""

""" Task 05 """
# Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел
# к полученной ранее сумме и после этого завершить программу.


def my_sum():
    sum_result = 0
    exit_func = True  # флаг выхода из цикла
    while exit_func:
        number = input('Введите через пробел числа (для завершения введите Q): ').split()
        result = 0  # возможность подчета новой группы чисел
        for i in range(len(number)):
            if number[i] == 'q' or number[i] == 'Q':
                exit_func = False
            else:
                result += int(number[i])
        sum_result += result
        print(f'Текущая сумма введенных чисел {sum_result}')
    print(f'Окончательная сумма введенных чисел {sum_result}')


my_sum()
